function [x,y,z] = fWave2(xb,xe,N,yb,ye,M,x1,y1,I1,f1,x2,y2,I2,f2)
%вычисляет значение электрического поля в узлах сетки x(i),y(j)
%область занятая антенной определяется радиусом r0
%в которой поле предполагается постоянным

lam = 2;   % длина волны излучения
r0 = lam/3;  % радиус цилинра, который обозначает антенну
k = 2*pi/lam; % волновое число излучения

dx = (xe - xb)/(N-1);
dy = (ye - yb)/(M-1);

%x = [];
%y = [];
%z = [];

x = zeros(1,N);
y = zeros(1,M);

%вычислем массивы x(i), y(j)
for i=1:N
    x(i) = xb + dx*(i-1);
    for j=1:M
        y(j) = yb + dy*(j-1);
    end
end

z = zeros(N,M);

%вычисляем массив E = z(i,j)
for i=1:N
    for j=1:M
        r1 = ((x(i) - x1)^2 + (y(j) - y1)^2)^0.5;

        if(r1 < r0)
            E1 = I1/r0;
        else
            E1 = I1/r1*((1/(k*r1)*cos(k*r1 + f1)+(1-1/(k*r1)^2))*sin(k*r1 + f1));
        end

        r2 = ((x(i) - x2)^2 + (y(j) - y2)^2)^0.5;
 
        if(r2 < r0)
            E2 = I2/r0;
        else
            E2 = I2/r2*((1/(k*r2)*cos(k*r2 + f2)+(1-1/(k*r2)^2))*sin(k*r2 + f2));
        end
        z(i,j) = E1 + E2;
    end
end
    




