%волна E - типа (TM - волна)
%волновод круглого сечения


%  распределение электрического и магнитного поля
%    по контуру волновода

%  распределение поверхностного заряда и поверхностного тока
%    по контуру волновода



clc
clear

format short g


%нули nu_nm функции Бесселя Jn(nu_nm) = 0
nuB(1,2) = 2.405; nuB(1,3) = 5.520; nuB(1,4) =  8.654; nuB(1,5) = 11.792;
nuB(2,2) = 3.832; nuB(2,3) = 7.016; nuB(2,4) = 10.173; nuB(2,5) = 13.324;
nuB(3,2) = 5.136; nuB(3,3) = 8.417; nuB(3,4) = 11.620; nuB(3,5) = 14.796;
nuB(4,2) = 6.380; nuB(4,3) = 9.761; nuB(4,4) = 13.015; nuB(4,5) = 16.223;

%в сечении z = 0
%в момент времени t0
t0 = 1/8; % в единичах периода T


%мощность, переносимая модой
P = 1000; % (Вт)


%радиус волновода
a = 2; % (cm)

fm = 50; %максимальная частота (GHz)
eGHz = 1.e+9; %один гигаГерц
c = 3.e+8; %скорость света (cm/m)
eps0 = 8.8542e-12; %электрическая постоянная (Ф/м)
mu0 = 4*pi*1.e-7; %магнитная постоянная (Гн/м)

%индексы волноводной моды E_nm
n=1; 
m=1;  

%нуль функции Бесселя
nu_nm = nuB(n+1,m+1);
%частота отсечки
f_nm = c/2/pi*nu_nm/a*100/eGHz; % (GHz)

fc = f_nm;
disp('fc=')
disp(fc)




%выбираем частоту f = 1.5*fc
f = 1.5*fc;  % (GHz)   
disp('f=')
disp(f)



%находим постоянную распространения 'bet' для моды E_nm
%на частоте f
bet = 2*pi/c*eGHz*sqrt(f.^2 - f_nm^2)/100;  % (1/cm)
disp('bet=')
disp(bet)


%находим длину волны моды E_nm
lamb = 2*pi/bet; % (cm)
disp('lamb=')
disp(lamb)

%находим фазовую скорость волны
vp = 2*pi*f*eGHz/bet; % (cm/c)
disp('vp=')
disp(vp)


%находим групповую скорость моды
vg = c*(c/vp)*10^4; % (cm/c)
disp('vg=')
disp(vg)




%Амплитуда моды
kA = bet*2*pi*f*eGHz*eps0/100*pi*nu_nm^2/2*(besselj(n+1,nu_nm))^2; % (Ф/(см^2*с))
A1 = sqrt(P/kA); % (В*см)
disp('A1=')
disp(A1)

%находим наибольшее значение электрического и магнитного полей
%на контуре волновода

%используем формулу J'_n(z) = n/z*J_n(z) - J_(n+1)(z)
Ampl = -nu_nm/a*A1*besselj(n+1,nu_nm); % (В)


Eampl = bet*Ampl;
Bampl = 2*pi*f*eGHz/c^2*Ampl;

Emax = abs(Eampl);              % (В/см)
Bmax = abs(Bampl);              % (Тл)
Hmax = Bmax/mu0/100;           % (А/см)   



disp('    Emax,      Bmax,      Hmax')
disp([Emax   Bmax   Hmax])


%находим наибольшее значение поверхностной плотности электрического заряда
%поверхностной плотности электрического тока
%на контуре волновода

roSampl = Eampl*100*eps0/10^4*10^9;
jSampl  = Bampl/mu0/100;          

roSmax = abs(roSampl);        % (нКл/см^2)
jSmax  = abs(jSampl);          % (А/см)

disp('    roSmax,    jSmax')
disp([roSmax   jSmax])



% ///////////////////////////////////////////////////
%находим поля, заряды и токи по контуру волновода


s1 = 0:0.01:2*pi*a;
psi1 = s1/a;
E1 = Eampl*sin(n*psi1 - 2*pi*t0);          % (В/см)
B1 = Bampl*sin(n*psi1 - 2*pi*t0);          % (Тл)
roS1 = roSampl*sin(n*psi1 - 2*pi*t0);   % (нКл/см^2)
jS1  = jSampl*sin(n*psi1 - 2*pi*t0);              % (А/см)



B1 = B1*10^6;
roS1 = roS1*10^2;

Bmax = Bmax*10^6;
roSmax = roSmax*10^2;

EBmax = max(Emax,Bmax);
roSjSmax = max(roSmax,jSmax);

% ///////////////////////////////////////////////////



%   3) ///////////////////////////////////////////////////
%рисуем распредление поля по контуру волновода

figure(12)
hPl = plot(s1,E1,s1,B1,'--');
set(hPl,'LineWidth',4);
axis([0 2*pi*a -1.1*EBmax 1.1*EBmax]);
%функция gca возвращает дескриптор текущих осей координат (гарафический объект axis)  
hAxes = gca;
%функция set устанавливает метки вдоль оси 'x' координатных осей hAxes
%set(hAxes,'xtick',[1.5 1.75 2.0 2.25 2.5])
set(hAxes,'FontSize',26,'FontWeight','bold');
%устанавливаем метку на оси 'x' текущих осей координат
xlabel('s     (cm)')
%устанавливаем метку на оси 'y' текущих осей координат
ylabel('E  (V/cm),        B (10^{-6} T)')
%title('E  (V/cm),          B (10^{-6} T)')

grid on


strn = int2str(n);
strm = int2str(m);
string = ['E   and   B   fields on countour.  TM - mode, E_',strn,'_',strm];
title(string)


% ///////////////////////////////////////////////////




%   4) ///////////////////////////////////////////////////
%рисуем распредление заряда и тока по контуру волновода

figure(13)
hPl = plot(s1,roS1,s1,jS1,'--');
set(hPl,'LineWidth',4);
axis([0 2*pi*a -1.1*roSjSmax 1.1*roSjSmax]);
%функция gca возвращает дескриптор текущих осей координат (гарафический объект axis)  
hAxes = gca;
%функция set устанавливает метки вдоль оси 'x' координатных осей hAxes
%set(hAxes,'xtick',[1.5 1.75 2.0 2.25 2.5])
set(hAxes,'FontSize',26,'FontWeight','bold');
%устанавливаем метку на оси 'x' текущих осей координат
xlabel('s     (cm)')
%устанавливаем метку на оси 'y' текущих осей координат
ylabel('\rho_{S}  (10^{-2} nQ/cm^{2}),        j_{S} (A/cm)')
%title('\rho_{S}  (10^{-2} nQ/cm^{2}),        j_{S} (A/cm)')

grid on
strn = int2str(n);
strm = int2str(m);
string = ['\rho_{S}    and    j_{S}    on countour.  TM - mode, E_',strn,'_',strm];
title(string)

% ///////////////////////////////////////////////////


format short
