%волна E - типа (TM - волна)
%рисование дисперсионных кривых 
%волновод круглого сечения

clc
clear


%нули nu_nm функции Бесселя Jn(nu_nm) = 0
nuB(1,2) = 2.405; 
nuB(2,2) = 3.832;
nuB(1,3) = 5.520;
nuB(2,3) = 7.016;
           

%радиус волновода
a = 2; % (cm)
fm = 50; %максимальная частота (GHz)
eGHz = 1.e+9; %один гигаГерц
c = 3.e+10; %скорость света (cm/s)



%///////////////////////////////////////
%индексы волноводной моды
n=1;  m=1;  

%нуль функции Бесселя
nu_nm = nuB(n+1,m+1);
%частота отсечки
f_nm = c/2/pi*nu_nm/a/eGHz; % (GHz)

%находим постоянную распространения 'bet' для моды E_11
f2=f_nm:0.01:fm;
bet2 = 2*pi/c*eGHz*sqrt(f2.^2 - f_nm^2);

%находим асимптотику bet = 2*pi/c*f
f0=0:0.01:fm;
bet0 = 2*pi/c*eGHz*f0;





hPl=plot(f2,bet2,f0,bet0,'--');
set(hPl,'LineWidth',4);
grid on

%функция gca возвращает дескриптор текущих осей координат (гарафический объект axis)  
hAxes = gca;
%функция set устанавливает метки вдоль оси 'x' координатных осей hAxes
%set(hAxes,'xtick',[1.5 1.75 2.0 2.25 2.5])
set(hAxes,'FontSize',20,'FontWeight','bold');


%устанавливаем метку на оси 'x' текущих осей координат
xlabel('f     (GHz)')
%устанавливаем метку на оси 'y' текущих осей координат
ylabel('\beta     (1/cm)')

text(12.0, 0.5,'E_{11}','Color',[0 0 0],'FontSize',20,'FontWeight','bold')
title('Dispersion Relation      \beta  =  \beta (f)  \newline        Cylindrical waveguide')


